app/controllers/api/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY created_at DESC
---
  def index
    @questions = Question.all

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello"], ["body", "Who am I?"], ["created_at", "2016-01-26 00:16:18.729766"], ["updated_at", "2016-01-26 00:16:18.729766"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 4]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
---
  def destroy
    Question.find_by_id(params[:id]).destroy